extends Area2D

# --- دسترسی به نودها ---
# از علامت % (Unique Name) استفاده می‌کنیم تا گیم‌منیجر را از هر جای درخت صحنه پیدا کنیم.
# این روش در گودو ۴ بسیار استاندارد و سریع است.
@onready var game_manager = %GameManager

# دسترسی به پلیر انیمیشن برای پخش صدای سکه و انیمیشن محو شدن
@onready var animation_player = $AnimationPlayer

# این تابع زمانی اجرا می‌شود که فیزیک بازیکن وارد محدوده سکه شود
# (سیگنال body_entered به این تابع وصل شده است)
func _on_body_entered(body):
	# 1. امتیاز دادن
	# تابعی را در گیم‌منیجر صدا می‌زنیم که امتیاز (Score) را یکی زیاد کند
	# و متن روی صفحه را آپدیت کند.
	game_manager.add_point()
	
	# 2. پخش انیمیشن برداشتن
	# نکته کلیدی برای استاد: ما اینجا دستور queue_free() (حذف) را ننوشتیم!
	# چرا؟ چون می‌خواهیم صدای سکه و انیمیشن محو شدن پخش شود.
	# در داخل خودِ انیمیشن "pickup"، یک ترک متد (Method Track) وجود دارد
	# که در پایان انیمیشن، سکه را حذف می‌کند.
	animation_player.play("pickup")
